export const statusChart = `flowchart TD
    %% Стилізація вузлів

    %% Початок
    Start([Початок]) --> N1

    %% Секція Потреб
    subgraph Needs ["📦 ПОТРЕБИ"]
        direction TB
        N1["На погодженні"]:::needs
        N2["Погоджено"]:::needs
        N1 --> N2
    end

    %% Секція Видачі
    subgraph Issuance ["🚀 ВИДАЧА"]
        direction TB
        I1["На видачу"]:::issuance
        
        subgraph Prep ["Підготовка"]
            direction LR
            I2["Готується"]:::issuance <--> I3["Готово"]:::issuance
        end
        
        subgraph Wait ["Очікування"]
            direction LR
            I4["На паузі"]:::issuance
            I5["Чекаєм на поставку"]:::issuance
            I7["Готується"]:::issuance
            I8["Готово"]:::issuance
        end

        F1["Видано"]:::done

        subgraph Post ["Сервіс"]
            direction LR
            F3["Повернули"]:::needs
            F4["Заміна"]:::issuance
        end
        
        I1 <--> Prep
        I1 <--> Wait
        I6["Відміна"]:::error
    end

    %% Секція Відхилені
    subgraph Final ["🏁 Відхилено"]
        direction TB
        F2["Відхилено"]:::error
    end

    %% Основні переходи між блоками
    N2 -- "Авто-перенос" --> I1
    
    I1 -- "Видати" --> F1
    F1 --> Post
    Post --> I1
    
    %% Повернення/Скасування

    N1 <--> F2
    
    F2 --> I1
    Prep --> I6
    I6 <--> I1
    `;
